#-------------------------------------------------------------------------------
# Name:        Resheto_Erisphena
# Purpose:
#
# Author:      Yuri Nesterovich
#
# Created:     06.04.2019
# Copyright:   (c) Fujitsu 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def primes(n):
    a = [0] * n
    for i in range(n):
        a[i] = i

    a[1] = 0

    m = 2 # замена на 0 начинается с 3-го элемента (первые два уже нули)
    while m < n: # перебор всех элементов до заданного числа
        if a[m] != 0: # если он не равен нулю, то
            j = m * 2 # увеличить в два раза (текущий элемент простое число)
            while j < n:
                a[j] = 0 # заменить на 0
                j = j + m # перейти в позицию на m больше
        m += 1


    b = []
    for i in a:
        if a[i] != 0:
            b.append(a[i])

    del a
    return b